Documents/А_ОтчетPL.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>А_ОтчетPL</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.А_ДенежныеСредстваФинАгенты</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеСтрока</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВключатьДочерние</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДанныеОтчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Статья</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.А_Статьи_PL</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаФома1</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаФорма2</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипСтроки</Name>
							<Type>
								<v8:Type>cfg:EnumRef.А_ТипСтатьиPL</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтрокаЛиста</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИтогиПоГруппам</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Группа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.А_ГруппаСтатей_PL</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаФ1_Excel</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаФ2_Excel</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма_Excel</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма_Расчёт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Расхождение</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИтогиОбщие</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Показатель</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидПоказателя</Name>
							<Type>
								<v8:Type>cfg:EnumRef.А_ВидПоказателяPL</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаФ1</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаФ2</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаИтого</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/А_ОтчетPL/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ОбновитьИндикаторРасхождений();

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	ОбновитьИндикаторРасхождений();

КонецПроцедуры

&НаСервере
Процедура ОбновитьИндикаторРасхождений()

	КолРасхожд = 0;
	ВсегоГрупп = Объект.ИтогиПоГруппам.Количество();
	Для Каждого Стр Из Объект.ИтогиПоГруппам Цикл
		Если Стр.Расхождение <> 0 Тогда
			КолРасхожд = КолРасхожд + 1;
		КонецЕсли;
	КонецЦикла;

	Если ВсегоГрупп = 0 Тогда
		ЗаголовокИндикатора = "● Итоги по группам не заполнены";
	ИначеЕсли КолРасхожд = 0 Тогда
		ЗаголовокИндикатора = "● Расхождений: 0 из " + Формат(ВсегоГрупп, "ЧГ=") + " (ОК)";
	Иначе
		ЗаголовокИндикатора = "● Расхождений: " + Формат(КолРасхожд, "ЧГ=") + " из " + Формат(ВсегоГрупп, "ЧГ=");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	ПодтянутьНаправлениеПоПодразделению();
КонецПроцедуры

&НаСервере
Процедура ПодтянутьНаправлениеПоПодразделению()
	Если ЗначениеЗаполнено(Объект.Подразделение)
		И НЕ ЗначениеЗаполнено(Объект.НаправлениеДеятельности) Тогда
		Объект.НаправлениеДеятельности = Объект.Подразделение.А_НаправлениеДеятельности;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСверкуСЕРП(Команда)

	ИспользуемПоНаправлению = Объект.ВключатьДочерние
		И ЗначениеЗаполнено(Объект.НаправлениеДеятельности);

	Если ИспользуемПоНаправлению Тогда
		ВариантКлюч = "А_ОтчетPL_РасшифровкаПоНаправлению";
		ПодразделениеОтбора = Неопределено;
		НаправлениеОтбора = Объект.НаправлениеДеятельности;
	Иначе
		ВариантКлюч = "А_ОтчетPL_РасшифровкаДокументаОтчетPL";
		ПодразделениеОтбора = ?(ЗначениеЗаполнено(Объект.Подразделение), Объект.Подразделение, Неопределено);
		НаправлениеОтбора = Неопределено;
	КонецЕсли;

	// Важно: НЕ передаём Отбор через ПараметрыФормы — БСП сделал бы его Недоступным
	// (см. ОтчетыСервер.УстановитьФиксированныеОтборы). Вместо этого пишем в
	// ПользовательскиеНастройки — так поля остаются редактируемыми в шапке.
	ПользовательскиеНастройки = СформироватьПользовательскиеНастройкиОтчета(
		Объект.Дата, ВариантКлюч, ПодразделениеОтбора, НаправлениеОтбора);

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("КлючВарианта", ВариантКлюч);
	Если ПользовательскиеНастройки <> Неопределено Тогда
		ПараметрыФормы.Вставить("ПользовательскиеНастройки", ПользовательскиеНастройки);
	КонецЕсли;
	ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);

	ОткрытьФорму("Отчет.А_ОтчетPL.Форма", ПараметрыФормы, ЭтаФорма);

КонецПроцедуры

&НаСервереБезКонтекста
Функция СформироватьПользовательскиеНастройкиОтчета(Дата, ВариантКлюч, ПодразделениеОтбора = Неопределено, НаправлениеОтбора = Неопределено)

	Отчет = Отчеты.А_ОтчетPL.Создать();

	Вариант = Отчет.СхемаКомпоновкиДанных.ВариантыНастроек.Найти(ВариантКлюч);
	Если Вариант = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;

	Компоновщик = Новый КомпоновщикНастроекКомпоновкиДанных;
	Источник = Новый ИсточникДоступныхНастроекКомпоновкиДанных(Отчет.СхемаКомпоновкиДанных);
	Компоновщик.Инициализировать(Источник);
	Компоновщик.ЗагрузитьНастройки(Вариант.Настройки);

	Период = Новый СтандартныйПериод;
	Период.ДатаНачала = НачалоМесяца(Дата);
	Период.ДатаОкончания = КонецМесяца(Дата);

	// Собираем GUID-ы полей отбора из основных настроек варианта
	// (в пользовательских настройках свойство ЛевоеЗначение недоступно —
	// элементы идентифицируются только по ИдентификаторПользовательскойНастройки).
	ИдентификаторПодразд = "";
	ИдентификаторНапр = "";
	Для Каждого ЭлВариантного Из Компоновщик.Настройки.Отбор.Элементы Цикл
		Если ТипЗнч(ЭлВариантного) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
			ИмяПоля = Строка(ЭлВариантного.ЛевоеЗначение);
			Если ИмяПоля = "Подразделение" Тогда
				ИдентификаторПодразд = ЭлВариантного.ИдентификаторПользовательскойНастройки;
			ИначеЕсли ИмяПоля = "НаправлениеДеятельности" Тогда
				ИдентификаторНапр = ЭлВариантного.ИдентификаторПользовательскойНастройки;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	Для Каждого Элемент Из Компоновщик.ПользовательскиеНастройки.Элементы Цикл
		ТипЭл = ТипЗнч(Элемент);

		Если ТипЭл = Тип("ЗначениеПараметраНастроекКомпоновкиДанных")
			И Элемент.ИдентификаторПользовательскойНастройки = "Период" Тогда
			Элемент.Значение = Период;
			Элемент.Использование = Истина;

		ИначеЕсли ТипЭл = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
			Идентификатор = Элемент.ИдентификаторПользовательскойНастройки;

			Если Идентификатор = ИдентификаторПодразд И ЗначениеЗаполнено(ПодразделениеОтбора) Тогда
				СписокЗначений = Новый СписокЗначений;
				СписокЗначений.Добавить(ПодразделениеОтбора);
				Элемент.ПравоеЗначение = СписокЗначений;
				Элемент.Использование = Истина;

			ИначеЕсли Идентификатор = ИдентификаторНапр И ЗначениеЗаполнено(НаправлениеОтбора) Тогда
				СписокЗначений = Новый СписокЗначений;
				СписокЗначений.Добавить(НаправлениеОтбора);
				Элемент.ПравоеЗначение = СписокЗначений;
				Элемент.Использование = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	Возврат Компоновщик.ПользовательскиеНастройки;

КонецФункции
